<script setup>
// emit
const emit = defineEmits(['changeAgrees']);

// data
const showJoinAgreeWrap = ref([false, false, false]);
const allAgree = ref(false);
const agrees = ref([]);

// data - ref
const allCheck = ref(null);
defineExpose({ allCheck, agrees, changeAgrees });

const refUseContent = ref(null);
const refPrivacyContent = ref(null);
const refAdagreeContent = ref(null);

// methods
function changeAllAgree() {
	allAgree.value ? (agrees.value = ['1', '2', '3']) : (agrees.value = []);
	emit('changeAgrees', agrees.value);
}

function changeAgrees() {
	allAgree.value = agrees.value.length === 3;
	emit('changeAgrees', agrees.value);
}

function toggleJoinAgreeWrap(index) {
	const type = [refUseContent, refPrivacyContent, refAdagreeContent];
	showJoinAgreeWrap.value[index] = !showJoinAgreeWrap.value[index];
	if (showJoinAgreeWrap.value[index]) {
		type[index].value.scrollTo(0, 0);
	}
}
const debounceToggleJoinAgreeWrap = debounce(toggleJoinAgreeWrap);
</script>
<template>
	<div class="agree_wrap">
		<h4>약관 동의</h4>
		<div class="line"></div>
		<div class="check_box">
			<label class="checkbox_wrap">
				전체 동의
				<input
					ref="allCheck"
					v-model="allAgree"
					type="checkbox"
					@change="changeAllAgree"
				/>
				<span class="checkmark"></span>
			</label>
		</div>
		<div class="agree_wrapper" :class="{ show: showJoinAgreeWrap[0] }">
			<div class="tlt">
				<label class="checkbox_wrap">
					이용약관 동의<span class="require">(필수)</span>
					<input
						v-model="agrees"
						value="1"
						type="checkbox"
						@change="changeAgrees"
					/>
					<span class="checkmark"></span>
				</label>
				<i class="toggle" @click="debounceToggleJoinAgreeWrap(0)"></i>
			</div>
			<div
				ref="refUseContent"
				class="agree_content"
				:class="{ show: showJoinAgreeWrap[0] }"
			>
				<div class="terms_contents">
					<h2>제1장 총칙</h2>
					<h3>제1조 (목적)</h3>
					<ol>
						<li>
							본 약관은 주식회사 씨제이이엔엠(이하 "회사"라 한다)이 IMFFECT C의
							광고주 서비스 (이하”IMFFECT C”라 한다)을 통해 제공하는 모든 인터넷
							정보 서비스(이하 "서비스"라 한다)를 이용함에 있어서 회사와
							정보이용자 간의 권리, 의무 및 책임사항을 규정함으로써 이용자의
							권익 보호를 목적으로 합니다.
						</li>
					</ol>
					<p></p>
					<h3>제2조 (정의)</h3>
					<ol>
						<li>
							① IMFFECT C는 회사의 상품정보, 컨텐츠 정보를 열람할 수 있는
							서비스를 의미합니다.
						</li>
						<li>
							② 회원은 회사와 IMFFECT C 서비스의 이용 계약을 체결하고 아이디를
							부여 받아 회사가 제공하는 서비스를 이용하는 모든 이용자를
							의미합니다. 회원은 서비스 내 모든 정보 열람이 가능합니다.
						</li>
					</ol>
					<h3>제3조 (약관의 효력과 개정)</h3>
					<ol>
						<li>
							① 이 약관의 내용은 회사가 운영하는 사이트 화면에 게시하거나 기타의
							방법으로 회원에게 공지함으로써 효력이 발생됩니다.
						</li>
						<li>
							② 회사는 이 약관의 내용을 이용자가 알 수 있도록 회원가입 시에
							게시하는 방법으로 공지합니다.
						</li>
						<li>
							③ 회사는 이 약관의 변경이 필요한 합리적인 사유가 발생될 경우
							관련법령에 위배되지 않는 범위 이내에서 본 약관의 내용을 변경할 수
							있으며, 적용일자 및 변경사유를 명시하여 현행 약관과 함께 회사가
							운영하는 사이트 화면에 적용일자 10일 전에 게시하거나, 기타의
							방법을 통해 회원에게 제공하고 기존 회원에게는 적용일자 및 변경될
							내용 중 중요사항에 대해 전자우편주소로 발송합니다.
						</li>
						<li>
							④ 단 회원에게 불리한 약관개정의 경우에는 적용일자 및 변경사유를
							명시하여 현행 약관과 함께 그 개정약관의 적용일자 30일 전부터
							적용일자 전일까지 공지하며, 공지 외에 전자우편주소 등의 전자적
							수단을 통해 따로 명확히 통지하도록 합니다.
						</li>
						<li>
							⑤ 회사가 전항에 따라 개정약관을 공지 또는 통지하면서 회원에게 약관
							변경 적용일까지 의사표시를 하지 않으면 의사표시가 동의된 것으로
							본다는 뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로
							거부의 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로
							봅니다.
						</li>
						<li>
							⑥ 회사는 세부 서비스에 대한 별도 운영규칙을 제정할 수 있고, 이
							경우 전3항에 준하는 방법으로 사전 고지합니다.
						</li>
					</ol>
					<h2>제2장 서비스 제공 및 이용</h2>
					<h3>제4조 (이용계약)</h3>
					<ol>
						<li>
							① 이용자는 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 이
							약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.
						</li>
						<li>
							② 이용 계약은 회원가입 희망자가 이용약관 동의 후 이용 신청에
							대하여 회사가 승낙함으로써 성립합니다.
						</li>
						<li>
							③ 회원으로 가입하여 서비스를 이용하기를 희망하는 자는 약관의
							내용에 대하여 동의를 한 다음 회사가 정한 소정 양식에 따라 요청하는
							개인 인적 사항을 제공하여 이용 신청을 합니다.
						</li>
						<li>
							④ 회사는 이용 신청에 대하여 특별한 사정이 없는 한 접수 순서대로
							이용 신청을 승낙합니다.
						</li>
						<li>
							⑤ 회사는 다음 각 호에 해당하는 경우 이용 신청에 대한 승낙을 제한할
							수 있고, 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
							<ol>
								<li>가. 서비스 관련 설비에 여유가 없는 경우</li>
								<li>나. 기술상 지장이 있는 경우</li>
								<li>다. 기타 회사의 사정상 필요하다고 인정되는 경우</li>
							</ol>
						</li>
						<li>
							⑥ 회사는 다음 각 호에 해당하는 사항을 인지하는 경우 동 이용계약
							신청을 별도의 통지 없이 승낙하지 아니할 수 있습니다.
							<ol>
								<li>가. 다른 사람의 명의를 사용하여 신청한 경우</li>
								<li>
									나. 이용 신청 시 필요 사항을 허위로 기재하여 신청한 경우
								</li>
								<li>
									다. 사회의 안녕과 질서 혹은 미풍양속을 저해할 목적으로 신청한
									경우
								</li>
								<li>라. 기타 회사가 정한 이용 신청 요건이 미비 된 경우</li>
								<li>
									마. 악성 프로그램 및 버그를 이용하거나 시스템 취약점을
									악용하는 등 부정한 방법을 서비스에 사용한 경우
								</li>
							</ol>
						</li>
						<li>
							⑦ 회사는 회원가입 시 회사코드가 서비스 DB에 존재하지 않아 직접
							입력할 경우, 임의로 가입 후 회사명을 기등록된 코드로 바꿀 수 있다.
						</li>
					</ol>
					<h3>제5조 (서비스 제공)</h3>
					<ol>
						<li>① IMFFECT C에서 제공하는 서비스의 내용은 무료입니다.</li>
						<li>
							② IMFFECT C의 내용 또는 서비스의 변경이 필요하다고 판단될 경우
							회사는 이를 추가 또는 변경할 수 있습니다. 단, 서비스 내용이 변경될
							경우 회사는 이용자에게 그 내용을 사전에 고지합니다.
						</li>
					</ol>
					<h3>제6조 (서비스 이용 및 제한)</h3>
					<ol>
						<li>
							① 회사의 업무 또는 기술상 특별한 지장이 없는 한, 중단 없이
							서비스를 제공함을 원칙으로 합니다.
						</li>
						<li>
							② 정보통신시설의 보수, 점검, 교체 및 고장, 통신의 두절 등의 사유가
							발생하거나, 시스템 장애, 서비스 이용의 폭주 등 불가항력으로 인하여
							서비스 이용에 지장이 있는 경우, 또는 기타 합리적인 사유발생 시
							서비스 이용의 전부 또는 일부에 대하여 중단 및 제한할 수 있습니다.
						</li>
						<li>
							③ IMFFECT C 정기점검으로 서비스 제공을 중단하고자 할 때에는 사전에
							서비스 중단사유 및 중단시간을 공지게시판을 통해 고지합니다.
						</li>
						<li>④ 회원은 직접 회원가입을 철회할 수 있습니다.</li>
					</ol>
					<h3>제7조 (배상책임)</h3>
					<ol>
						<li>
							회사는 서비스의 일부 또는 전부의 수정, 중단, 변경으로 인해 손해가
							발생하여도 이용자에게 별도의 배상책임이 없습니다. 또한, 서비스의
							신뢰에 기인한 손실 등, 여타 간접적인 이익의 손실에 대하여서는
							어떠한 책임이 없음을 알려드립니다.
						</li>
					</ol>
					<h3>제8조 (서비스 이용 책임)</h3>
					<ol>
						<li>
							회원은 회사가 제공하는 서비스를 이용하여 사전 승낙 없이 영업
							활동을 할 수 없으며, 특히 해킹, 돈벌이 광고, 음란 사이트 등을 통한
							상업 행위, 상용 소프트웨어 불법 배포 등을 할 수 없습니다. 이를
							어기고 발생한 영업 활동의 결과 및 손실, 관계 기관에 의한 처벌 등
							법적 조치 등에 관해서는 회사가 책임을 지지 않습니다.
						</li>
					</ol>
					<h3>제9조 (서비스 제공의 중지 등)</h3>
					<ol>
						<li>
							① 회사는 다음 각 호에 해당하는 경우 서비스 제공을 중지할 수
							있습니다.
							<ol>
								<li>가. 서비스용 설비의 보수 등 공사로 인한 부득이한 경우</li>
								<li>
									나. 전기통신 사업법에 규정된 기간통신 사업자가 전기통신
									서비스를 중지했을 경우
								</li>
								<li>다. 기타 불가항력적 사유가 있는 경우</li>
							</ol>
						</li>
						<li>
							② 회사는 국가 비상사태, 정전, 서비스 설비의 장애 또는 서비스
							이용의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 때에는
							서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다.
						</li>
						<li>
							③ 회사는 본조 1항 및 2항의 규정에 의하여 서비스의 이용을
							제한하거나 중지한 때에는 그 사유 및 제한 기간 등을 공지를 통하여
							회원에게 알려줍니다.
						</li>
						<li>
							④ 회사는 운영상, 법률상, 기술상의 필요에 따라 상당한 이유가 있는
							경우에 한하여 제공하고 있는 전부 또는 일부 서비스를 변경∙중단할 수
							있습니다.
						</li>
						<li>
							⑤ 회사는 상기 4항에 따라 서비스의 내용, 이용방법, 이용시간,
							이용금액에 대하여 변경∙중단이 있는 경우에는 변경∙중단의 사유,
							변경될 서비스의 내용 및 제공 일자 등을 그 변경∙중단 전에 제3조에
							따라 고지합니다.
						</li>
					</ol>
					<h2>제3장 회사의 의무사항</h2>
					<h3>제10조 (회사의 의무)</h3>
					<ol>
						<li>
							회사는 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를
							제공하는 데 최선을 다해야 합니다.
						</li>
					</ol>
					<h3>제11조 (면책)</h3>
					<ol>
						<li>
							① 회사는 다음 각 호의 사유로 인하여 회원 또는 제3자에게 발생한
							손해에 대하여는 그 책임을 지지 아니합니다.
							<ol>
								<li>
									가. 천재지변 또는 이에 준하는 불가항력으로 인해 서비스를
									제공할 수 없는 경우
								</li>
								<li>
									나. 회원이 자신의 아이디 또는 비밀번호 등의 관리를 소홀히 한
									경우
								</li>
								<li>
									다. 회사의 관리영역이 아닌 공중통신선로의 장애로 서비스이용이
									불가능한 경우
								</li>
								<li>
									라. 기타 회사의 귀책사유가 없는 통신서비스 등의 장애로 인한
									경우
								</li>
							</ol>
						</li>
						<li>
							② 회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에
							대하여 책임을 지지 않습니다.
						</li>
						<li>
							③ 회사는 회원 상호간 또는 회원과 제3자 상호간에 서비스와 관련하여
							발생한 분쟁에 대하여 개입할 의무가 없으며, 회사에 귀책사유가 없는
							한 이로 인하여 발생한 손해를 배상할 책임이 없습니다.
						</li>
					</ol>
					<h3>제12조 (회원의 의무)</h3>
					<ol>
						<li>
							① 회원은 이 약관에서 규정하는 사항과 이용 안내 또는 공지 사항 등을
							통하여 회사가 공지하는 사항을 준수하여야 하며, 기타 회사의 업무에
							방해되는 행위를 하여서는 안됩니다.
						</li>
						<li>
							② 회원의 아이디와 비밀번호에 관한 모든 관리 책임은 회원에게
							있습니다. 회원에게 부여된 아이디와 비밀번호의 관리 소홀, 부정
							사용에 의하여 발생하는 모든 결과에 대한 책임은 회원에게 있습니다.
						</li>
						<li>
							③ 회원은 자신의 아이디나 비밀번호가 부정하게 사용되었다는 사실을
							발견한 경우에는 즉시 회사에 신고하여야 하며, 신고를 하지 않아
							발생하는 모든 결과에 대한 책임은 회원에게 있습니다.
						</li>
						<li>
							④ 회원은 회사의 사전 승낙 없이 서비스를 이용하여 영업 활동을 할 수
							없으며, 그 영업 활동의 결과와 회원이 약관에 위반한 영업 활동을
							하여 발생한 결과에 대하여 회사는 책임을 지지 않습니다. 회원은 이와
							같은 영업 활동으로 회사가 손해를 입은 경우 회사에 대하여 손해 배상
							의무를 집니다.
						</li>
						<li>
							⑤ 회원은 회사의 명시적인 동의가 없는 한 서비스의 이용 권한, 기타
							이용 계약상 지위를 타인에게 양도, 증여할 수 없으며 이를 담보로
							제공할 수 없습니다.
						</li>
						<li>
							⑥ 회원은 서비스 이용과 관련하여 다음 각 호에 해당되는 행위를
							하여서는 안됩니다.
							<ol>
								<li>가. 타인의 아이디와 비밀번호 등을 도용하는 행위</li>
								<li>
									나. 본 서비스를 통하여 얻은 정보를 회사의 사전 승낙 없이
									회원의 이용 이외의 목적으로 복제하거나 이를 출판 및 방송 등에
									사용하거나 제 3자에게 제공하는 행위
								</li>
								<li>
									다. 특허, 상표, 영업 비밀, 저작권 기타 지식재산권을 침해하는
									내용을 게시, 전자우편 또는 기타의 방법으로 타인에게 유포하는
									행위
								</li>
								<li>
									라. 공공질서 및 미풍양속에 위반되는 저속, 음란한 내용의 정보,
									문장, 도형 등을 전송, 게시, 전자우편 또는 기타의 방법으로
									타인에게 유포하는 행위
								</li>
								<li>
									마. 모욕적이거나 위협적이어서 타인의 개인정보를 침해할 수 있는
									내용을 전송, 게시, 전자우편 또는 기타의 방법으로 타인에게
									유포하는 행위
								</li>
								<li>바. 범죄와 결부된다고 객관적으로 판단되는 행위</li>
								<li>
									사. 회사의 승인을 받지 않고 다른 이용자의 개인정보를 수집 또는
									저장하는 행위
								</li>
								<li></li>
								<li>아. 기타 관계 법령에 위배되는 행위</li>
							</ol>
						</li>
					</ol>
					<h3>제13조 (계약 해지 및 이용 제한)</h3>
					<ol>
						<li>
							① 회원이 이용 계약을 해지하고자 하는 경우에는 회원 본인이 사이트
							상에서 또는 전화나, 전자우편을 통해 회원 탈퇴를 회사에 신청해야
							합니다.
						</li>
						<li>
							② 회사는 회원이 다음 각 호에 해당하는 행위를 하였을 경우 사전 통지
							없이 이용 계약을 해지하거나 또는 기간을 정하여 서비스 이용을
							중지할 수 있습니다.
							<ol>
								<li>가. 타인의 개인정보, 아이디 및 비밀번호를 도용한 경우</li>
								<li>
									나. 타인의 명예를 손상시키거나 불이익을 주는 행위를 한 경우
								</li>
								<li>
									다. 회사, 다른 회원 또는 제 3자의 지적재산권을 침해하는 경우
								</li>
								<li>
									라. 공공질서 및 미풍양속에 저해되는 내용을 고의로 유포시킨
									경우
								</li>
								<li>
									마. 회원이 국익 또는 사회적 공익을 저해할 목적으로 서비스
									이용을 계획 또는 실행하는 경우
								</li>
								<li>바. 서비스 운영을 고의로 방해한 경우</li>
								<li>
									사. 정보통신 설비의 오작동이나 정보의 파괴를 유발시키는 컴퓨터
									바이러스 프로그램 등을 유포하는 경우
								</li>
							</ol>
						</li>
						<li>
							③ 회원과 이용계약이 해지되는 경우 회원정보는 다음의 경우를
							제외하고 즉시 회원의 개인정보를 파기하는 것으로 합니다.
							<ol>
								<li>가. 관계 법령에 의한 예외적인 보관이 필요한 경우</li>
								<li>
									나. 고객상담 및 회원의 추가적인 피해 방지를 위해 30일간
									보관하는 경우
								</li>
							</ol>
						</li>
					</ol>
					<h2>제4장 기타</h2>
					<h3>제14조 (저작권의 귀속 및 이용 제한)</h3>
					<ol>
						<li>
							홈페이지에 게시된 일체의 저작물의 저작권은 회사에 귀속되며,
							이용자는 홈페이지를 이용함으로써 얻은 정보나 저작물을 회사의 사전
							승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여
							사용하거나 제3자에게 사용하게 하여서는 안됩니다.
						</li>
					</ol>
					<h3>제15조 (약관 외 준칙)</h3>
					<ol>
						<li>
							이 약관에 명시되지 아니한 사항에 대해서는 약관의 규제에 관한 법률,
							콘텐츠산업진흥법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률
							및 기타 관련 법령의 규정에 따르며 유료서비스 이용자의 경우에는
							전자상거래 등에서의 소비자보호에 관한 법률 및 유료이용약관의
							적용을 받습니다.
						</li>
					</ol>
					<h3>제16조 (분쟁해결)</h3>
					<ol>
						<li>
							① 회사는 회원으로부터 제출되는 불만사항 및 의견을 신속히
							처리합니다. 단, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와
							처리 일정을 지체 없이 통보합니다.
						</li>
						<li>
							② 한국에 거주하는 회원의 경우, 서비스 이용으로 발생한 분쟁에 대해
							소송이 제기될 경우, 회원의 주소를 관할하는 지방법원을 관할법원으로
							합니다. 단, 제소 당시 회원의 주소 또는 거소가 분명하지 아니한
							경우에는 민사소송법에 따라 관할 법원을 정합니다.
						</li>
					</ol>
					<h3>부칙(시행일)</h3>
					<ol>
						<li>이 약관은 2023년 12월 13일부터 적용되는 것으로 합니다.</li>
					</ol>
				</div>
			</div>
		</div>
		<div class="agree_wrapper" :class="{ show: showJoinAgreeWrap[1] }">
			<div class="tlt">
				<label class="checkbox_wrap">
					개인정보처리방침
					<span class="require">(필수)</span>
					<input
						v-model="agrees"
						value="2"
						type="checkbox"
						@change="changeAgrees"
					/>
					<span class="checkmark"></span>
				</label>
				<i class="toggle" @click="debounceToggleJoinAgreeWrap(1)"></i>
			</div>
			<div
				ref="refPrivacyContent"
				class="agree_content"
				:class="{ show: showJoinAgreeWrap[1] }"
			>
				<div class="terms_contents">
					<ol>
						<li>
							IMFFECT C 서비스 (이하 “서비스”) 운영사인 주식회사 씨제이이엔엠
							엔터테인먼트부문(이하 “회사”)은 이용자(회원 및 비회원 포함)의
							개인정보를 적극적으로 보호하며 개인정보 보호법 등 관계 법령을
							준수하기 위하여 개인정보처리방침(이하 “개인정보처리방침")을
							제정하고 이를 준수하고 있습니다. 또한 아래에 게시된 개인정보 보호
							정책을 통하여 이용자가 제공하는 개인정보가 어떠한 용도와 방식으로
							이용되고 있으며, 개인정보 보호를 위해 어떠한 조치가 취해지고
							있는지 알려드립니다.<br />본 개인정보처리방침은 회사가 운영하는
							서비스에 공개되며, 이용자가 언제나 쉽게 찾아볼 수 있도록 하고
							있습니다. 회사의 개인정보처리방침은 다음의 내용을 포함합니다.
						</li>
					</ol>
					<h2 id="terms1">1. 개인정보의 수집/이용 등에 대한 동의 방법</h2>
					<ol>
						<li>
							이용자의 개인정보 수집, 이용, 제3자 제공 및 처리 업무의 위탁 등에
							대한 동의의 방법은 서비스 회원가입 시 게시된 ‘서비스 이용약관’ 및
							'개인정보처리방침'을 숙지하신 후 서비스에서 제공하는 ‘동의 버튼’을
							클릭함으로써 완료됩니다.
						</li>
					</ol>
					<h2 id="terms2">
						2. 수집하는 개인정보 항목 및 개인정보 수집/이용 목적
					</h2>
					<ol>
						<li>
							회사는 서비스 제공을 위하여 필요한 최소한의 개인정보를
							서비스로부터 개인정보를 수집, 이용합니다. 다만, 이용자가 동의하는
							경우에 한하여 ‘선택 정보’를 수집, 이용하고 있습니다.
						</li>
					</ol>
					<h3>가. 개인정보 수집/이용 목적, 항목, 보유기간</h3>
					<h4>1&#41; (필수) 개인정보 수집 및 이용 동의</h4>
					<table>
						<caption>
							개인정보 수집 및 이용 동의/ 이용목적, 항목, 보유기간
						</caption>
						<tbody>
							<tr>
								<th scope="row">수집/이용 목적</th>
								<td>
									회원 가입 및 서비스 제공, 본인 식별 및 실명확인, 회원 및
									서비스에 대한 고지사항 전달, 서비스 개발을 위한 통계분석
								</td>
							</tr>
							<tr>
								<th scope="row">수집항목</th>
								<td>
									[일반 사용자]<br />
									필수정보 - 아이디, 비밀번호, 이름, 생년월일, 이동전화번호,
									이메일, 법인명, 본인인증 정보(CI)<br />
									선택정보 - 직무<br />
									[임직원]<br />
									필수정보 - 아이디, 비밀번호, 이름, 생년월일, 이동전화번호,
									이메일, 회사 소속 정보(사번/부서정보, 입사/재직/퇴직 정보)
								</td>
							</tr>
							<tr>
								<th scope="row">보유기간</th>
								<td>
									회원 탈퇴 후 7일까지 또는 정보주체의 개인정보 수집/이용 동의
									철회 요청 즉시 삭제<br />
									동의 거부 권리와 불이익 병시하여야 함.
								</td>
							</tr>
						</tbody>
					</table>
					<h4>2&#41; (선택) 마케팅, 혜택 소식 받기 동의</h4>
					<table>
						<caption>
							마케팅, 혜택 소식 받기 동의/ 이용목적, 항목, 보유기간
						</caption>
						<tbody>
							<tr>
								<th scope="row">수집/이용 목적</th>
								<td>
									이메일을 통한 광고 상품 소개, 행사/각종 이벤트 정보 안내 및
									제반 마케팅 활동, 당사 상품/서비스 안내 및 권유
								</td>
							</tr>
							<tr>
								<th scope="row">수집항목</th>
								<td>이름, 생년월일, 이동전화번호, 이메일, 법인명</td>
							</tr>
							<tr>
								<th scope="row">보유기간</th>
								<td>
									회원 탈퇴 후 7일까지 또는 정보주체의 개인정보 수집/이용 동의
									철회 요청 즉시 삭제
								</td>
							</tr>
						</tbody>
					</table>
					<h4>
						3&#41; (선택) 광고주 설명회 신청 및 이용을 위한 개인정보 수집 및
						이용 동의
					</h4>
					<table>
						<caption>
							광고주 설명회 신청 및 이용을 위한 개인정보 수집 및 이용 동의/
							이용목적, 항목, 보유기간
						</caption>
						<tbody>
							<tr>
								<th scope="row">수집/이용 목적</th>
								<td>
									광고주 설명회 신청 및 참석, 본인 확인, 행사 관련 안내 사항
									전달(SMS, 알림톡), 문의 응대
								</td>
							</tr>
							<tr>
								<th scope="row">수집항목</th>
								<td>아이디, 이름, 이메일, 이동전화번호, 법인명</td>
							</tr>
							<tr>
								<th scope="row">보유기간</th>
								<td>광고주 설명회 행사 종료일로부터 1개월 이내</td>
							</tr>
						</tbody>
					</table>
					<h4>
						4&#41; (선택) 뉴스레터 서비스 구독을 위한 개인정보 수집 이용 및 동의
					</h4>
					<table>
						<caption>
							뉴스레터 서비스 구독을 위한 개인정보 수집 이용 및 동의/ 이용목적,
							항목, 보유기간
						</caption>
						<tbody>
							<tr>
								<th scope="row">수집/이용 목적</th>
								<td>뉴스레터 발송</td>
							</tr>
							<tr>
								<th scope="row">수집항목</th>
								<td>이름, 이메일, 법인명(소속 회사명)</td>
							</tr>
							<tr>
								<th scope="row">보유기간</th>
								<td>
									회원 탈퇴 후 7일까지 또는 정보주체의 개인정보 수집/이용 동의
									철회 요청 즉시 삭제
								</td>
							</tr>
						</tbody>
					</table>
					<h4>
						5&#41; (선택) 1:1 문의하기 이용을 위한 개인정보 수집 및 이용 동의
					</h4>
					<table>
						<caption>
							1:1 문의하기 이용을 위한 개인정보 수집 및 이용 동의/ 이용목적,
							항목, 보유기간
						</caption>
						<tbody>
							<tr>
								<th scope="row">수집/이용 목적</th>
								<td>
									1:1 문의하기 서비스 이용, 답변 관리 및 서비스 제안, 문의 답변
									및 고객 안내, 서비스 개발 및 개선을 위한 활용
								</td>
							</tr>
							<tr>
								<th scope="row">수집항목</th>
								<td>이름, 이동전화번호, 이메일, 법인명</td>
							</tr>
							<tr>
								<th scope="row">보유기간</th>
								<td>문의 접수일로부터 365일 지난 후 파기</td>
							</tr>
						</tbody>
					</table>
					<h3>나. 수집 방법</h3>
					<ol class="dot">
						<li>서비스 접속, 회원가입 및 이용을 통한 정보 수집</li>
						<li>로그 분석 프로그램을 통한 생성정보 수집</li>
					</ol>
					<h3>다. 생성 정보 수집</h3>
					<ol class="dot">
						<li>
							<strong
								>서비스 이용 과정이나 사업 처리 과정에서 생성되어 수집되는
								정보</strong
							><br />서비스 이용 과정이나 처리 과정에서 개인 서비스 제공을
							위하여 아래와 같은 정보들이 생성되어 수집될 수 있습니다.
							<ol class="dot">
								<li>서비스 이용시간 및 이용기록</li>
								<li>접속 정보 및 로그, 접속IP정보 및 세션, 쿠키</li>
							</ol>
						</li>
					</ol>
					<h2 id="terms3">3. 개인정보의 보유, 이용기간 및 파기</h2>
					<h3>1&#41; 이용기간 및 보유기간</h3>
					<ol>
						<li>
							개인정보는 회사가 이용자에게 서비스를 제공하는 기간(이용기간) 또는
							분쟁처리 기간(보유기간) 동안에 한하여 보유하고 이를 활용합니다.
							<ol>
								<li>가. 이용기간: 서비스 가입일 ~ 해지일 까지</li>
								<li>
									나. 보유기간: 불량회원의 부정한 이용의 재발 방지 및 서비스
									혼선 방지를 위해 이용계약 해지일로부터 30일간 또는 해당 이용
									목적이 종료된 때까지 보유
								</li>
							</ol>
						</li>
					</ol>
					<h3>2&#41; 개인정보의 보관 및 보존기간</h3>
					<ol>
						<li>
							회사는 정보 주체에게 동의 받은 기간 또는 전자상거래 등에서의
							소비자보호에 관한 법률 등 관계 법령의 규정에 의하여 보존할 필요가
							있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 개인정보를
							보관합니다. 이 경우 회사는 보관하는 정보를 그 보관의 목적으로만
							이용하며 보존기간은 아래와 같습니다.
							<ol class="dot">
								<li>
									소비자의 불만 또는 분쟁 처리에 관한 기록: 3년(전자상거래
									등에서의 소비자보호에 관한 법률)
								</li>
								<li>
									방문자 접속(로그)에 관한 기록/정보통신기기의 위치를 확인할 수
									있는 접속지 추적자료: 3개월(통신비밀보호법), 기타
									통신비밀보호법 제15조의2 및 동법 시행령 제41조에 따른
									통신사실확인자료의 각 기간
								</li>
								<li>
									그 외 보관 및 보존기간
									<ol>
										<li>
											- 국세기본법 등에 따라 거래 기록을 보관해야 하는 경우
										</li>
										<li>- 정보주체에게 별도 동의를 받은 경우</li>
									</ol>
								</li>
							</ol>
						</li>
					</ol>
					<h3>3&#41; 개인정보의 파기절차 및 방법</h3>
					<ol>
						<li>
							가. 파기 절차: 이용자가 서비스 가입 등을 위해 제공하신 정보는
							목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에
							의한 보유 사유에 따라 일정기간 저장된 후, 아래 다항에 명시한
							방법으로 파기됩니다. 별도 DB에 옮겨진 개인정보는 법률에 의해
							보유되는 경우가 아니고서는 이외의 다른 목적으로 이용되지 않습니다.
						</li>
						<li>
							나. 파기 대상: 보유기간 및 관련 법령에 따른 보존기간이 종료된
							이용자 개인정보
						</li>
						<li>
							다. 파기방법
							<ol class="dot">
								<li>서면에 작성, 출력된 개인정보: 분쇄하거나 소각</li>
								<li>
									DB 등 전자적 파일 형태로 저장된 개인정보: 기록을 재생할 수
									없는 기술적 방법으로 삭제
								</li>
							</ol>
						</li>
					</ol>
					<h2 id="terms4">4. 개인정보의 제3자 제공 및 공유에 대한 동의</h2>
					<ol>
						<li>
							회사는 이용자의 개인정보를 '서비스 이용약관' 또는
							'개인정보처리방침'에서 명시한 범위 내에서 이용하며, 명시한 범위를
							넘어서 개인정보를 이용하거나 제3자에게 제공하지 않습니다. 다만,
							이용자의 사전 동의가 있거나, 관련 법령이 정한 규정과 절차에 따라
							요청하는 경우 제공합니다.
						</li>
					</ol>
					<h2 id="terms5">5. 개인정보 처리의 위탁 동의</h2>
					<ol>
						<li>
							회사는 서비스 이용계약, A/S 제공 및 그 부대 업무의 대행 등 이용자
							편의 제공, 관리 등을 위하여 개인정보 처리 업무를 위탁하고 있으며,
							수탁자에 대해서는 개인정보 위∙수탁 계약서 등을 통하여 관련 법규 및
							지침의 준수, 정보보호 및 비밀유지, 제3자 제공 금지, 사고 시
							책임부담, 위탁기간 종료 즉시 개인정보의 반납/파기 의무 등을
							규정하여 관리하고 있습니다.<br />
							회사는 개인정보 처리를 위탁 받은 업체가 개인정보 보호와 관련 하여
							제반의 조치를 취하도록 하며 만약 이용자의 개인정보를 위탁 받은
							업체가 고의 또는 과실로 인하여 이용자에게 손해를 입힌 경우 그에
							대한 모든 책임을 부담합니다.
						</li>
					</ol>
					<table class="top_tlt">
						<caption>
							개인정보 처리의 위탁 동의
						</caption>
						<thead>
							<th scope="col">위탁업체</th>
							<th scope="col">위탁업무 목적</th>
						</thead>
						<tbody>
							<tr>
								<th scope="row">CJ 올리브네트웍스</th>
								<td>
									서비스 개발, 운영 및 유지보수, 기술 지원, 문자 발송 서비스
									활용
								</td>
							</tr>
							<tr>
								<th scope="row">스티비 주식회사</th>
								<td>뉴스레터 서비스 이용 및 발송 관리, 문의 대응</td>
							</tr>
							<tr>
								<th scope="row">GS네오텍</th>
								<td>서비스 인프라 운영 및 모니터링</td>
							</tr>
							<tr>
								<th scope="row">아마존 클라우드</th>
								<td>서비스 인프라 및 메일 발송 서비스 활용</td>
							</tr>
						</tbody>
					</table>
					<h2 id="terms6">6. 개인정보 국외 이전</h2>
					<ol>
						<li>
							회사는 서비스 이용 및 A/S 제공 및 그 부대 업무의 대행 등 이용자
							편의 제공, 관리 등을 위하여 개인정보 처리 업무를 위해 국외 이전을
							실시하고 있지않습니다. 다만, 서비스 제공을 위해 개인정보의 국외
							이전 필요 시 정보주체에게 명확하게 고지/안내 후 동의를 얻은 정보에
							한해 이전합니다.
						</li>
					</ol>
					<h2 id="terms7">7. 개인정보에 대한 이용자의 권리와 그 행사 방법</h2>
					<ol>
						<li>
							서비스 이용자는 언제나 서비스를 방문하여 등록되어 있는 자신의
							개인정보를 조회하거나 수정할 수 있으며, 개인정보의 수집과 이용,
							위탁 또는 제공에 대한 동의의 철회 및 가입 해지를 요청할 수
							있습니다.
							<ol>
								<li>
									1&#41; 이용자는 개인정보의 수집과 이용 또는 제공에 대한 동의를
									철회할 수 있습니다. 동의 철회를 위해서는 서비스에서 제공하는
									‘회원정보 수정-회원 탈퇴’ 서비스에서 본인 확인 절차를 거친 후,
									회원 탈퇴와 함께 동의를 철회할 수 있습니다.
								</li>
								<li>
									2&#41; 이용자는 IMFFECT C 이메일, 고객센터 등을 통해
									개인정보에 대한 열람, 증명을 요구할 수 있습니다.
								</li>
								<li>
									3&#41; 이용자가 본인의 개인정보에 대한 열람, 증명을 요구하는
									경우 이용자 본인의 신분을 증명할 수 있는 주민등록증, 여권,
									운전면허증 등의 신분증명(사본)을 받아 본인 여부를 확인합니다.
								</li>
								<li>
									4&#41; 이용자의 대리인이 이용자 개인정보의 열람, 증명을
									요구하는 경우에는 회사는 대리 관계를 나타내는 위임장, 명의
									이용자의 인감증명서와 대리인의 신분증명서 등의 증표를 제시
									받아 대리인인지 여부를 확인합니다.
								</li>
								<li>
									5&#41; 이용자가 개인정보의 오류에 대해 정정을 요청한 경우에는
									회사는 정정을 완료하기 전까지 해당 개인정보를 이용 또는
									제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미
									제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여
									정정이 이루어지도록 하겠습니다.
								</li>
								<li>
									6&#41; 단, 회사는 다음과 같은 경우에는 예외적으로 개인정보의
									열람 및 정정을 제한할 수 있습니다.
									<ol>
										<li>
											가. 이용자(정보주체) 본인 또는 제 3 자의 생명, 신체, 재산
											또는 권익을 현저하게 해할 우려가 있는 경우
										</li>
										<li>
											나. 당해 서비스 제공자의 업무에 현저한 지장을 미칠 우려가
											있는 경우
										</li>
										<li>다. 법령에 위반하는 경우</li>
									</ol>
								</li>
							</ol>
						</li>
					</ol>
					<h2 id="terms8">8. 만14세 미만 아동의 개인정보 보호</h2>
					<ol>
						<li>
							1&#41; 회사는 만14세 미만 아동(이하 ‘아동’이라 함)의 회원 가입이
							불가하며, 개인정보를 수집하지 않습니다. 다만, 서비스 제공을 위해
							부득이 수집해야 할 경우 반드시 아동의 법정대리인의 동의를 구하고
							있습니다.
						</li>
						<li>
							2&#41; 회사는 법정대리인의 동의를 받기 위하여 아동으로부터
							법정대리인의 이름과 연락처 등 최소한의 개인정보를 수집할 수
							있습니다. 법정대리인은 아동의 개인정보에 대한 열람, 정정 및 삭제를
							할 수 있으며, 아동의 개인정보를 열람, 정정 및 삭제하고자 할
							경우에는 고객센터를 통해 요청하시면 필요한 조치를 취해 드립니다.
						</li>
					</ol>
					<h2 id="terms9">9. 이용자 의견수렴 및 불만처리</h2>
					<ol>
						<li>
							회사는 이용자의 의견을 매우 소중하게 생각합니다. 문의사항이 있으신
							경우 아래의 연락처로 문의주시면 신속하고 정확한 답변을
							드리겠습니다.
							<ol>
								<li>
									1&#41; 개인정보보호 책임자
									<ol class="dot privacy-dot">
										<li>성명 : 문인호님</li>
										<li>소속 : CJ ENM 경영지원&#41;DX전략팀</li>
										<li>
											이메일 :
											<a href="mailto:inho.moon1@cj.net" target="_blank"
												>inho.moon1@cj.net</a
											>
										</li>
									</ol>
								</li>
								<li>
									2&#41; 개인정보보호 담당자
									<ol class="dot privacy-dot">
										<li>성명 : 전효민님</li>
										<li>소속 : CJ ENM 경영지원&#41;DX전략팀</li>
										<li>
											이메일 :
											<a href="mailto:hm.jeon2@cj.net" target="_blank"
												>hm.jeon2@cj.net</a
											>
										</li>
									</ol>
									<ol class="dot privacy-dot">
										<li>성명 : 최경진님</li>
										<li>소속 : CJ ENM 경영지원&#41;DX전략팀</li>
										<li>
											이메일 :
											<a href="mailto:koungjin.choi@cj.net" target="_blank"
												>koungjin.choi@cj.net</a
											>
										</li>
									</ol>
								</li>
							</ol>
						</li>
					</ol>
					<h2 id="terms10">10. 개인정보의 기술적, 관리적 보호</h2>
					<ol>
						<li>
							회사는 이용자의 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지
							않도록 안전성 확보를 위하여 다음과 같은 기술적·관리적 대책을
							마련하고 있습니다.
							<ol>
								<li>
									1&#41; 기술적 보호대책
									<ol>
										<li>
											가. 개인정보는 비밀번호에 의해 보호되며, 중요한 데이터는
											파일 및 전송 데이터를 암호화하거나 파일 잠금기능(Lock)을
											사용하는 등의 별도 보안기능을 통해 보호되고 있습니다.
										</li>
										<li>
											나. 백신 프로그램을 이용하여 컴퓨터바이러스에 의한 피해를
											방지하기 위한 조치를 취하고 있습니다. 백신프로그램은
											주기적으로 업데이트되며 갑작스런 바이러스가 출현할 경우
											백신이 나오는 즉시 이를 도입, 적용함으로써 개인정보가
											침해되는 것을 방지하고 있습니다.
										</li>
										<li>
											다. 네트워크 상의 개인정보를 안전하게 전송할 수 있도록
											보안장치(SSL)를 채택하고 있습니다.
										</li>
										<li>
											라. 해킹 등에 의해 이용자의 개인정보가 유출되는 것을
											방지하기 위해, 외부로부터 접근이 통제된 구역에 시스템을
											설치하고, 침입을 차단하는 장치를 이용하고 있습니다.
										</li>
									</ol>
								</li>
								<li>
									2&#41; 관리적 보호대책
									<ol>
										<li>
											가. 회사는 이용자의 개인정보에 대한 관리와 접근에 필요한
											절차를 마련하여 임직원이 이를 숙지하고 준수하도록 하고
											있으며 준수 여부를 주기적으로 점검하고 있습니다.
										</li>
										<li>
											나. 회사는 이용자의 개인정보를 처리할 수 있는 자를
											최소한으로 제한하고 접근 권한을 관리하며, 교육을 통하여
											법규 및 정책을 준수할 수 있도록 하고 있습니다. 이용자의
											개인정보를 처리하는 자는 다음과 같습니다.
											<ol class="dot">
												<li>
													이용자를 직·간접적으로 상대하여 업무를 처리하는 자
												</li>
												<li>
													개인정보보호책임자 및 개인정보보호담당자 등 개인정보
													관리 및 개인정보보호 업무를 담당하는 자
												</li>
												<li>기타 업무상 개인정보의 접근이 불가피한 자</li>
											</ol>
										</li>
										<li>
											다. 신규직원 채용 시 정보보호서약서에 서명함으로써 직원에
											의한 정보(개인정보 포함)유출을 사전에 방지하고, 수시로
											개인정보보호 의무를 상기시키며 준수 여부를 감사하기 위한
											내부 절차를 마련하여 시행하고 있습니다.
										</li>
										<li>
											라. 개인정보 처리자의 업무 인수인계는 보안이 유지된
											상태에서 철저하게 이뤄지고 있으며, 입사 및 퇴사 후
											개인정보 침해사고에 대한 책임을 명확하게 규정하고
											있습니다.
										</li>
									</ol>
								</li>
							</ol>
						</li>
					</ol>
					<h2 id="terms11">11. 개인정보 침해 관련 상담 및 신고</h2>
					<ol>
						<li>
							개인정보 침해에 대한 상담 및 신고가 필요하신 경우에는 개인정보
							관련 담당자에게 전화 또는 이메일로 연락하시거나, 아래 기관으로
							문의하시기 바랍니다.
							<ol class="tel">
								<li>
									☎ KISA 개인정보침해신고센터 <br />
									전화 : (국번없이) 118 / 홈페이지 :
									<a
										href="https://privacy.kisa.or.kr"
										target="_blank"
										rel="noopener noreferrer"
										>https://privacy.kisa.or.kr</a
									>
								</li>
								<li>
									☎ 대검찰청 사이버수사과<br />
									전화 : (국번없이) 1301/ 홈페이지 :
									<a
										href="http://www.spo.go.kr"
										target="_blank"
										rel="noopener noreferrer"
										>http://www.spo.go.kr</a
									>
								</li>
								<li>
									☎ 경찰청 사이버수사국 사이버범죄 신고시스템(ECRM)<br />
									전화 : (국번없이) 182 / 홈페이지 :
									<a
										href="https://ecrm.police.go.kr"
										target="_blank"
										rel="noopener noreferrer"
										>https://ecrm.police.go.kr</a
									>
								</li>
								<li>
									☎ 개인정보 분쟁조정위원회<br />
									전화 : (국번없이) 1833-6972 홈페이지 :
									<a
										href="https://www.kopico.go.kr"
										target="_blank"
										rel="noopener noreferrer"
										>https://www.kopico.go.kr</a
									>
								</li>
							</ol>
						</li>
					</ol>
					<h2 id="terms12">12. 개인정보처리방침의 고지 또는 민원 처리</h2>
					<ol>
						<li>
							이용자 개인정보의 수집, 처리, 관리 등의 업무를 위탁하는 경우에는
							서비스 ‘개인정보처리방침’ 등을 통하여 그 사실을 이용자에게
							고지합니다. 이용자는 회사의 서비스를 이용하시며 발생하는 모든
							개인정보보호 관련 민원을 서비스 고객센터 또는 시스템/개인정보보호
							관리자에게 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해
							신속하게 충분한 답변을 드릴 것입니다.
						</li>
					</ol>
					<h2 id="terms13">13. 고지의 의무</h2>
					<ol>
						<li>
							개인정보보호 관련 법령, 정책 또는 보안기술 등의 변경에 따라 현
							개인정보처리방침의 내용 추가, 삭제 및 수정이 있을 시에는
							개인정보처리방침 개정 시에는 개정 이전에 서비스 공지사항을 통해
							고지할 것입니다.<br /><br />
						</li>
						<li>
							현재 개인정보 처리방침 버전 : 1. 3
							<ol>
								<li>- 고시일 : `24. 04. 23</li>
								<li>- 시행일 : `24. 04. 30</li>
							</ol>
						</li>
					</ol>
				</div>
			</div>
		</div>
		<div class="agree_wrapper" :class="{ show: showJoinAgreeWrap[2] }">
			<div class="tlt">
				<label class="checkbox_wrap"
					>마케팅 및 광고성 정보 제공 동의
					<input
						v-model="agrees"
						value="3"
						type="checkbox"
						@change="changeAgrees"
					/>
					<span class="checkmark"></span>
				</label>
				<i class="toggle" @click="debounceToggleJoinAgreeWrap(2)"></i>
			</div>
			<div
				ref="refAdagreeContent"
				class="agree_content"
				:class="{ show: showJoinAgreeWrap[2] }"
			>
				<div class="terms_contents">
					<h3>수집/이용 목적</h3>
					<ol>
						<li>
							이메일을 통한 광고 상품 소개, 행사/각종 이벤트 정보 안내 및 제반
							마케팅 활동, 당사 상품/서비스 안내 및 권유
						</li>
					</ol>
					<h3>수집항목</h3>
					<ol>
						<li>이름, 생년월일, 이동전화번호, 이메일, 법인명</li>
					</ol>
					<h3>보유기간</h3>
					<ol>
						<li>
							회원 탈퇴 후 7일까지 또는 정보주체의 개인정보수집/이용 동의 철회
							요청 즉시 삭제
						</li>
					</ol>
					<p class="notice">
						※ 정보주체는 동의를 거부할 권리가 있습니다. 동의 거부 시 서비스 이용
						제한은 발생하지 않습니다.
					</p>
				</div>
			</div>
		</div>
	</div>
</template>
